spec/support/vcr_cassettes/emis/get_military_service_episodes/valid_v2.yml

---
http_interactions:
- request:
    method: post
    uri: https://localhost:4438/VIERSService/eMIS/v2/MilitaryInformationService
    body:
      encoding: ASCII-8BIT
      string: |2

        <soap:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://viers.va.gov/cdi/CDI/commonService/v2" xmlns:v12="http://viers.va.gov/cdi/eMIS/RequestResponse/v2" xmlns:v13="http://viers.va.gov/cdi/eMIS/commonService/v2" xmlns:v11="http://viers.va.gov/cdi/eMIS/RequestResponse/MilitaryInfo/v2">
          <soap:Header>
            <v1:inputHeaderInfo>
              <v1:userId>vets.gov</v1:userId>
              <v1:sourceSystemName>vets.gov</v1:sourceSystemName>
              <v1:transactionId>e3cd6b94-fc72-42c2-bb1a-e1f0453edf9a</v1:transactionId>
            </v1:inputHeaderInfo>
          </soap:Header>
          <soap:Body>
            <v11:eMISserviceEpisodeRequest>
              <v12:edipiORicn>
                <v13:edipiORicnValue>1607472595</v13:edipiORicnValue>
                <v13:inputType>EDIPI</v13:inputType>
              </v12:edipiORicn>
            </v11:eMISserviceEpisodeRequest>
          </soap:Body>
        </soap:Envelope>
    headers:
      Accept:
      - text/xml;charset=UTF-8
      Content-Type:
      - text/xml;charset=UTF-8
      User-Agent:
      - Vets.gov Agent
      Soapaction:
      - http://viers.va.gov/cdi/eMIS/getMilitaryServiceEpisodes/v1
      Date:
      - Mon, 25 Nov 2019 20:51:59 GMT
      Content-Length:
      - '949'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Mon, 25 Nov 2019 20:52:00 GMT
      Server:
      - Apache/2.4.6 (Red Hat Enterprise Linux)
      Content-Length:
      - '3022'
      Cache-Control:
      - max-age=0, no-store
      Content-Type:
      - application/soap+xml;charset=utf-8
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="utf-8"?><NS1:Envelope xmlns:NS1="http://www.w3.org/2003/05/soap-envelope"><NS1:Header><NS2:essResponseCode
        xmlns:NS2="http://va.gov/ess/message/v1">Success</NS2:essResponseCode><NS3:inputHeaderInfo
        xmlns:NS3="http://viers.va.gov/cdi/CDI/commonService/v2"><NS3:userId>vets.gov</NS3:userId><NS3:sourceSystemName>vets.gov</NS3:sourceSystemName><NS3:transactionId>e3cd6b94-fc72-42c2-bb1a-e1f0453edf9a</NS3:transactionId></NS3:inputHeaderInfo></NS1:Header><NS1:Body><NS4:eMISserviceEpisodeResponse
        xmlns:NS4="http://viers.va.gov/cdi/eMIS/RequestResponse/MilitaryInfo/v2"><NS5:militaryServiceEpisode
        xmlns:NS5="http://viers.va.gov/cdi/eMIS/RequestResponse/v2"><NS6:edipi xmlns:NS6="http://viers.va.gov/cdi/eMIS/commonService/v2">1607472595</NS6:edipi><NS7:keyData
        xmlns:NS7="http://viers.va.gov/cdi/eMIS/commonService/v2"><NS7:personnelOrganizationCode>22</NS7:personnelOrganizationCode><NS7:personnelCategoryTypeCode>V</NS7:personnelCategoryTypeCode><NS7:personnelSegmentIdentifier>1</NS7:personnelSegmentIdentifier></NS7:keyData><NS8:militaryServiceEpisodeData
        xmlns:NS8="http://viers.va.gov/cdi/eMIS/commonService/v2"><NS8:serviceEpisodeStartDate>2007-04-01</NS8:serviceEpisodeStartDate><NS8:serviceEpisodeEndDate>2016-06-01</NS8:serviceEpisodeEndDate><NS8:serviceEpisodeTerminationReason>S</NS8:serviceEpisodeTerminationReason><NS8:branchOfServiceCode>F</NS8:branchOfServiceCode><NS8:retirementTypeCode>B</NS8:retirementTypeCode><NS8:personnelProjectedEndDate>1990-02-22</NS8:personnelProjectedEndDate><NS8:personnelProjectedEndDateCertaintyCode>U</NS8:personnelProjectedEndDateCertaintyCode><NS8:dischargeCharacterOfServiceCode>K</NS8:dischargeCharacterOfServiceCode><NS8:honorableDischargeForVaPurposeCode>K</NS8:honorableDischargeForVaPurposeCode><NS8:personnelStatusChangeTransactionTypeCode>343</NS8:personnelStatusChangeTransactionTypeCode><NS8:narrativeReasonForSeparationCode>033</NS8:narrativeReasonForSeparationCode><NS8:narrativeReasonForSeparationTxt>SUFFICIENT
        SERVICE FOR RETIREMENT</NS8:narrativeReasonForSeparationTxt><NS8:post911GIBillLossCategoryCode>06</NS8:post911GIBillLossCategoryCode><NS8:mgadLossCategoryCode>08</NS8:mgadLossCategoryCode><NS8:activeDutyServiceAgreementQuantity>3</NS8:activeDutyServiceAgreementQuantity><NS8:initialEntryTrainingEndDate>1987-05-30</NS8:initialEntryTrainingEndDate><NS8:uniformServiceInitialEntryDate>1986-07-01</NS8:uniformServiceInitialEntryDate><NS8:militaryAccessionSourceCode>00</NS8:militaryAccessionSourceCode><NS8:personnelBeginDateSource>7</NS8:personnelBeginDateSource><NS8:personnelTerminationDateSourceCode>8</NS8:personnelTerminationDateSourceCode><NS8:activeFederalMilitaryServiceBaseDate>1987-02-22</NS8:activeFederalMilitaryServiceBaseDate><NS8:mgsrServiceAgreementDurationYearQuantityCode>4</NS8:mgsrServiceAgreementDurationYearQuantityCode><NS8:dodBeneficiaryTypeCode>07</NS8:dodBeneficiaryTypeCode></NS8:militaryServiceEpisodeData></NS5:militaryServiceEpisode></NS4:eMISserviceEpisodeResponse></NS1:Body></NS1:Envelope>
    http_version: 
  recorded_at: Mon, 25 Nov 2019 20:52:00 GMT
recorded_with: VCR 3.0.3
